load_tests/report.txt
Running 5s test @ http://localhost:8080
  4 threads and 12 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.46ms    1.59ms  25.98ms   95.52%
    Req/Sec        nan       nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25ms
 75.000%    2.75ms
 90.000%    3.30ms
 99.000%    7.20ms
 99.900%   25.02ms
 99.990%   26.00ms
 99.999%   26.00ms
100.000%   26.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.629     0.000000            1         1.00
       1.431     0.100000          251         1.11
       1.717     0.200000          501         1.25
       1.915     0.300000          752         1.43
       2.079     0.400000         1001         1.67
       2.255     0.500000         1253         2.00
       2.339     0.550000         1378         2.22
       2.427     0.600000         1504         2.50
       2.529     0.650000         1626         2.86
       2.645     0.700000         1752         3.33
       2.749     0.750000         1877         4.00
       2.823     0.775000         1943         4.44
       2.901     0.800000         2001         5.00
       2.981     0.825000         2065         5.71
       3.071     0.850000         2126         6.67
       3.175     0.875000         2189         8.00
       3.239     0.887500         2222         8.89
       3.303     0.900000         2251        10.00
       3.407     0.912500         2284        11.43
       3.499     0.925000         2314        13.33
       3.693     0.937500         2345        16.00
       3.751     0.943750         2362        17.78
       3.811     0.950000         2376        20.00
       3.963     0.956250         2392        22.86
       4.207     0.962500         2408        26.67
       4.331     0.968750         2423        32.00
       4.431     0.971875         2431        35.56
       4.539     0.975000         2439        40.00
       4.899     0.978125         2447        45.71
       5.495     0.981250         2455        53.33
       5.735     0.984375         2462        64.00
       6.103     0.985938         2466        71.11
       6.515     0.987500         2470        80.00
       6.823     0.989062         2474        91.43
       7.323     0.990625         2478       106.67
       8.807     0.992188         2482       128.00
       9.631     0.992969         2484       142.22
      12.135     0.993750         2486       160.00
      12.383     0.994531         2488       182.86
      14.991     0.995313         2490       213.33
      15.215     0.996094         2492       256.00
      15.407     0.996484         2493       284.44
      19.359     0.996875         2494       320.00
      19.679     0.997266         2495       365.71
      19.967     0.997656         2496       426.67
      20.079     0.998047         2497       512.00
      20.079     0.998242         2497       568.89
      25.023     0.998437         2498       640.00
      25.023     0.998633         2498       731.43
      25.391     0.998828         2499       853.33
      25.391     0.999023         2499      1024.00
      25.391     0.999121         2499      1137.78
      25.743     0.999219         2500      1280.00
      25.743     0.999316         2500      1462.86
      25.743     0.999414         2500      1706.67
      25.743     0.999512         2500      2048.00
      25.743     0.999561         2500      2275.56
      25.999     0.999609         2501      2560.00
      25.999     1.000000         2501          inf
#[Mean    =        2.461, StdDeviation   =        1.594]
#[Max     =       25.984, Total count    =         2501]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2505 requests in 5.00s, 604.23KB read
  Non-2xx or 3xx responses: 2505
Requests/sec:    500.61
Transfer/sec:    120.75KB