load_tests/report.txt
Running 5s test @ http://localhost:8080
  4 threads and 12 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.61ms    1.69ms  25.07ms   95.48%
    Req/Sec        nan       nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.37ms
 75.000%    2.90ms
 90.000%    3.54ms
 99.000%    7.29ms
 99.900%   24.56ms
 99.990%   25.09ms
 99.999%   25.09ms
100.000%   25.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.814     0.000000            1         1.00
       1.555     0.100000          251         1.11
       1.822     0.200000          503         1.25
       2.020     0.300000          751         1.43
       2.189     0.400000         1006         1.67
       2.367     0.500000         1254         2.00
       2.447     0.550000         1377         2.22
       2.553     0.600000         1505         2.50
       2.659     0.650000         1629         2.86
       2.769     0.700000         1753         3.33
       2.895     0.750000         1877         4.00
       2.979     0.775000         1941         4.44
       3.045     0.800000         2003         5.00
       3.131     0.825000         2065         5.71
       3.243     0.850000         2127         6.67
       3.365     0.875000         2193         8.00
       3.441     0.887500         2222         8.89
       3.535     0.900000         2253        10.00
       3.635     0.912500         2285        11.43
       3.777     0.925000         2316        13.33
       3.939     0.937500         2346        16.00
       3.999     0.943750         2362        17.78
       4.073     0.950000         2377        20.00
       4.291     0.956250         2393        22.86
       4.503     0.962500         2409        26.67
       4.867     0.968750         2424        32.00
       4.951     0.971875         2432        35.56
       5.127     0.975000         2440        40.00
       5.287     0.978125         2448        45.71
       5.559     0.981250         2456        53.33
       5.947     0.984375         2463        64.00
       6.151     0.985938         2467        71.11
       6.363     0.987500         2471        80.00
       6.779     0.989062         2475        91.43
       7.595     0.990625         2479       106.67
       8.703     0.992188         2483       128.00
       8.783     0.992969         2485       142.22
       9.079     0.993750         2487       160.00
      10.127     0.994531         2489       182.86
      17.743     0.995313         2491       213.33
      20.655     0.996094         2493       256.00
      21.647     0.996484         2494       284.44
      21.967     0.996875         2495       320.00
      23.039     0.997266         2496       365.71
      24.159     0.997656         2497       426.67
      24.559     0.998047         2499       512.00
      24.559     0.998242         2499       568.89
      24.559     0.998437         2499       640.00
      24.559     0.998633         2499       731.43
      24.783     0.998828         2500       853.33
      24.783     0.999023         2500      1024.00
      24.783     0.999121         2500      1137.78
      24.815     0.999219         2501      1280.00
      24.815     0.999316         2501      1462.86
      24.815     0.999414         2501      1706.67
      24.815     0.999512         2501      2048.00
      24.815     0.999561         2501      2275.56
      25.087     0.999609         2502      2560.00
      25.087     1.000000         2502          inf
#[Mean    =        2.607, StdDeviation   =        1.692]
#[Max     =       25.072, Total count    =         2502]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2506 requests in 5.00s, 604.47KB read
  Non-2xx or 3xx responses: 2506
Requests/sec:    500.70
Transfer/sec:    120.78KB